0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/baffle3DRegion/T
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
  bottom
  {
    type                compressible::thermalBaffle;
    kappa               solidThermo;
    kappaName           none;
    value               uniform 300;
  }
  side
  {
    type                zeroGradient;
  }
  top
  {
    type                compressible::thermalBaffle;
    kappa               solidThermo;
    kappaName           none;
    value               uniform 300;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
