0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/include/3DBaffle/extrudeModel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

extrudeModel        linearNormal;
nLayers             ${nLayers};
expansionRatio      1;
columnCells         ${oneD}; //3D
linearNormalCoeffs
{
    thickness           ${thickness};
}

// ************************************************************************* //
