0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.1;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "caseDicts/setConstraintTypes"
  floor
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
  ceiling
  {
    type            kqRWallFunction;
    value           uniform 0.1;
  }
  inlet
  {
    type            fixedValue;
    value           uniform 0.1;
  }
  outlet
  {
    type            zeroGradient;
  }
  fixedWalls
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
