0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "caseDicts/setConstraintTypes"
  floor
  {
    type            calculated;
    value           uniform 101325;
  }
  ceiling
  {
    type            calculated;
    value           uniform 101325;
  }
  inlet
  {
    type            calculated;
    value           uniform 101325;
  }
  outlet
  {
    type            calculated;
    value           uniform 101325;
  }
  fixedWalls
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
