0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/constant/thermophysicalProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      thermophysicalProperties;
}

thermoType
{
  type            heRhoThermo;
  mixture         pureMixture;
  transport       const;
  thermo          hConst;
  equationOfState perfectGas;
  specie          specie;
  energy          sensibleEnthalpy;
}
mixture
{
  specie
  {
    nMoles          1;
    molWeight       28.96;
  }
  thermodynamics
  {
    Cp              1004.4;
    Hf              0;
  }
  transport
  {
    mu              1.831e-05;
    Pr              0.705;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
