0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/system/baffle3DRegion/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system/baffleRegion";
  object      fvSolution;
}

solvers
{
  h
  {
    solver           PCG;
    smoother         GaussSeidel;
    preconditioner   DIC;
    tolerance        1e-06;
    relTol           0;
  }
}
nNonOrthCorr        0;
relaxationFactors
{
  h       1;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
