0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      controlDict;
}

application     mousse-buoyantSimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2500;
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
libs ("libthermalBaffleModels.so");

// vim: set ft=foam et sw=2 ts=2 sts=2:
