0.1.0/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSchemes;
}

ddtSchemes
{
  default     steadyState;
}
gradSchemes
{
  default     Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss limitedLinear 0.2;
  div(phi,K)      bounded Gauss limitedLinear 0.2;
  div(phi,h)      bounded Gauss limitedLinear 0.2;
  div(phi,k)      bounded Gauss limitedLinear 0.2;
  div(phi,epsilon) bounded Gauss limitedLinear 0.2;
  div(phi,omega) bounded Gauss limitedLinear 0.2;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         none;
  laplacian((rho*nuEff),U) Gauss linear uncorrected;
  laplacian(rhorAUf,p_rgh) Gauss linear uncorrected;
  laplacian(alphaEff,h) Gauss linear uncorrected;
  laplacian((rho*DkEff),k) Gauss linear uncorrected;
  laplacian((rho*DepsilonEff),epsilon) Gauss linear uncorrected;
  laplacian((rho*DomegaEff),omega) Gauss linear uncorrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         uncorrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
